namespace Homework
{
    internal class Program
    {
/*Задание 1
Создайте приложение для работы с коллекцией стихов. Необходимо хранить такую информацию:

Название стиха;
ФИО автора;
Год написания;
Текст стиха;
Тема стиха.
Приложение должно позволять:

Добавлять стихи;
Удалять стихи;
Изменять информацию о стихах;
Искать стих по разным характеристикам;
Сохранять коллекцию стихов в файл;
Загружать коллекцию стихов из файла.
Приложение должно иметь возможность генерировать отчёты. Отчёт может быть отображён на экран или сохранён в файл. Создайте такие отчёты:

По названию стиха;
По ФИО автора;
По теме стиха;
По слову в тексте стиха;
По году написания стиха;
По длине стиха.
Задание 2
Разработайте приложение для поиска файлов по маске. Пользователь вводит путь к папке и маску для поиска. Например:

D:\DataForUser
*.txt

Приложение должно отобразить все файлы с расширением txt по пути D:\DataForUser. Поиск должен происходить в папках и подпапках.

Задание 3
Разработайте приложение для удаления файлов по маске. Пользователь вводит путь к папке и маску для поиска удаляемых файлов. Например:

D:\DataForUser
*.txt

Приложение должно удалить все файлы с расширением txt по пути D:\DataForUser.

Файлы должны удаляться в папках и подпапках. Также должны удаляться подпапки в папках.

Задание 4
Пользователь вводит с клавиатуры название ресторана.

Напишите регулярное выражение для проверки названия ресторана. В названии не может быть символов %, &, ), (.

Задание 5
Пользователь вводит с клавиатуры адрес ресторана.

Напишите регулярное выражение для проверки адреса ресторана. В названии могут быть только буквы английского алфавита и цифры.

Задание 6
Пользователь вводит с клавиатуры название кухни ресторана.

Напишите регулярное выражение для проверки названия кухни ресторана. В названии могут быть только буквы английского алфавита в любом регистре. Пример названия кухни: italian, ukrainian, georgian, jewish и т.д.

Задание 7
Пользователь вводит с клавиатуры оценку работы ресторана. Напишите регулярное выражение для проверки оценки. Оценка может варьироваться от 1 до 12.

Задание 8
Разработайте приложение для оценки деятельности ресторана. Пользователь вводит с клавиатуры такую информацию:

Ник;
Электронный адрес;
Номер телефона;
Название ресторана;
Адрес ресторана;
Кухня ресторана;
Контактный номер телефона ресторана;
Оценка ресторана;
Отзыв пользователя о ресторане.
Используя регулярные выражения проверьте данные, введенные в форму. Если пользователь где-то совершил ошибку при вводе, сообщите ему об этом. Если информация была введена успешно, сохраните информацию в файл.*/
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
