namespace Poem
{
    internal class FabricReports
    {/*Задание 1
Создайте приложение для работы с коллекцией стихов. Необходимо хранить такую информацию:

Название стиха;
ФИО автора;
Год написания;
Текст стиха;
Тема стиха.
Приложение должно позволять:

Добавлять стихи;
Удалять стихи;
Изменять информацию о стихах;
Искать стих по разным характеристикам;
Сохранять коллекцию стихов в файл;
Загружать коллекцию стихов из файла.
Приложение должно иметь возможность генерировать отчёты. Отчёт может быть отображён на экран или сохранён в файл. Создайте такие отчёты:

По названию стиха;
По ФИО автора;
По теме стиха;
По слову в тексте стиха;
По году написания стиха;
По длине стиха.*/
        static void Main(string[] args)
        {
        }
    }
}
