namespace Task2_3
{
    internal class Program
    {
        /*Задание 2
Разработайте приложение для поиска файлов по маске. Пользователь вводит путь к папке и маску для поиска. Например:

D:\DataForUser
*.txt

Приложение должно отобразить все файлы с расширением txt по пути D:\DataForUser. Поиск должен происходить в папках и подпапках.

Задание 3
Разработайте приложение для удаления файлов по маске. Пользователь вводит путь к папке и маску для поиска удаляемых файлов. Например:

D:\DataForUser
*.txt*/
        static void Main(string[] args)
        {
            string[] value = {
                    "This is .NET World", "Hello World", "My Wonderfull world"
                };
        }
    }

}
